authors = {
    'Косач': 'Видатна українська поетеса, драматургиня, перекладачка та громадська діячка. Її творчість насичена патріотизмом та глибоким громадським звучанням',
    'Коцюбинський': 'Український письменник, прозаїк, драматург, есеїст, громадський діяч. Його творчість сповнена патріотизму та любові до України',
    'Шевченко': 'Великий український поет, художник, мислитель і громадський діяч. Національний герой та символ України, Шевченко став одним з найзначніших діячів української к культури'
}
aftor = input("Прізвище автора?")
if aftor in authors:
    print('Автор є')
else:
    zaproc = input("автора нема, чи додати його?")
    if zaproc == "так":
        biography = input("введи біографію")
        authors[aftor] = biography
    else:
        print("окей")
print(authors)